desafio7/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "date", "image_url", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create

    @post = Post.new(title: params[:post][:title], date: params[:post][:date], image_url: params[:post][:image_url], content: params[:post][:content])
    @post.content = params[:post][:content].gsub('spoiler', '')
    if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."date" DESC
---
  def index
    @posts = Post.all.order(date: :desc)