desafio12/veterinary/app/controllers/pet_histories_controller.rb

  def index
    @pet_histories = PetHistory.all
---
SELECT "pet_histories".* FROM "pet_histories"

  def new
    @pet_history = PetHistory.new
    @pets = Pet.all
---
SELECT "pets".* FROM "pets"

  def create
    @pet_history = PetHistory.new(pet_history_params)

    respond_to do |format|
      if @pet_history.save
---
INSERT INTO "pet_histories" ("weigth", "height", "diagnosis", "pet_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["weigth", 12], ["height", 16], ["diagnosis", "pulgas"], ["pet_id", 1], ["created_at", "2020-08-14 01:32:23.382468"], ["updated_at", "2020-08-14 01:32:23.382468"]]

    def set_pet_history
      @pet_history = PetHistory.find(params[:id])
---
SELECT "pet_histories".* FROM "pet_histories" WHERE "pet_histories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]