desafio12/veterinary/app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets"
---
  def index
    @pets = Pet.all

SELECT "pet_histories".* FROM "pet_histories" WHERE "pet_histories"."pet_id" = ?  [["pet_id", 1]]
SELECT MAX("pet_histories"."weigth") FROM "pet_histories" WHERE "pet_histories"."pet_id" = ?  [["pet_id", 1]]
SELECT MAX("pet_histories"."height") FROM "pet_histories" WHERE "pet_histories"."pet_id" = ?  [["pet_id", 1]]
SELECT AVG("pet_histories"."weigth") FROM "pet_histories" WHERE "pet_histories"."pet_id" = ?  [["pet_id", 1]]
SELECT AVG("pet_histories"."height") FROM "pet_histories" WHERE "pet_histories"."pet_id" = ?  [["pet_id", 1]]
---
  def show
    @pet_histories = @pet.pet_histories
    @pet_max_weigth = @pet_histories.maximum(:weigth)
    @pet_max_heigth = @pet_histories.maximum(:height)
    @pet_average_weigth = @pet_histories.average(:weigth)
    @pet_average_heigth = @pet_histories.average(:height)

SELECT "pets".* FROM "pets" WHERE "pets"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pet
      @pet = Pet.find(params[:id])