UF_app/app/controllers/ufs_controller.rb

  def daily
    setting = Setting.first
    setting.request_count += 1
    setting.save
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "settings" SET "request_count" = ? WHERE "settings"."id" = ?  [["request_count", 1], ["id", 1]]

  def stats
    @stats = Setting.first
---
SELECT "settings".* FROM "settings" ORDER BY "settings"."id" ASC LIMIT ?  [["LIMIT", 1]]